eisup_2019_docmng_integration/src/Documents/ttk_НастройкаПользовательскихПодписок/ttk_НастройкаПользовательскихПодписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_НастройкаПользовательскихПодписок</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ttk_ПользовательскиеПодпискиНаСобытия</registerRecords>
  <attributes>
    <name>ВидПодписки</name>
    <type>
      <types>CatalogRef.ttk_ВидыПользовательскихПодписок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСписком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписки</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыНСИ/абс_СтатусыНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыНСИ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеКадровиком</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеИнформации</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_КатегорияПодразделения/абс_КатегорияПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_КатегорияПодразделения</name>
  <enumValues>
    <name>Департамент</name>
  </enumValues>
  <enumValues>
    <name>Дирекция</name>
  </enumValues>
  <enumValues>
    <name>Отдел</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>Служба</name>
  </enumValues>
  <enumValues>
    <name>ОП</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ВидПодразделения</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДирекцией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДепартаментом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодИСУЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтноситсяКФинСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипПодразделенияОрганизации</name>
    <type>
      <types>EnumRef.абс_ТипыПодразделенийОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КатегорияПодразделения</name>
    <type>
      <types>EnumRef.абс_КатегорияПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Блок</name>
    <type>
      <types>CatalogRef.абс_Блоки</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалитьабс_Ответственные</name>
    <attributes>
      <name>ОтветственныйСотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильПолномочийПользователя</name>
    <type>
      <types>CatalogRef.ПрофилиПолномочийПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИмяВДомене</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтправлятьУведомления</name>
    <type>
      <types>EnumRef.абс_РежимОтправкиУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтправлятьУведомленияКакИнициатору</name>
    <type>
      <types>EnumRef.абс_РежимОтправкиУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РасширенноеПравоПроведенияДокументов</name>
    <comment>(без контроля номенклатуры и контрагентов)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеСниматьРегламентно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТелефонныйКодГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоПользовательАбсолютСофт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеАктивныйПользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПользовательОС_СтароеЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/ttk_НастройкаПользовательскихПодписок/ManagerModule.bsl
Функция ЗаполнитьПоПодразделению(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПодразделенияОрганизаций.Ссылка КАК ПодразделениеОрганизации,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Дт, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = Пользователи.ФизЛицо
		|		ПО ПодразделенияОрганизаций.Ссылка = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	ПодразделенияОрганизаций.Владелец = &Организация
		|	И ПодразделенияОрганизаций.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыНСИ.Согласовано)
		|	И ПодразделенияОрганизаций.абс_КатегорияПодразделения = ЗНАЧЕНИЕ(Перечисление.абс_КатегорияПодразделения.Департамент)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дт", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
